Repository: RontgenGIT/rontgen-uzduotis
Catalog: boilerplate/src/Locale/*/default.po
Languages: lt

source: Delete
lt: Trinti

source: Edit
lt: Redaguoti

source: Wallet
lt: Piniginė

source: Type
lt: Tipas

source: Description
lt: Aprašymas

source: Amount
lt: Suma

source: Created
lt: Sukurta

source: List Users
lt: Vartotojų sąrašas

source: Add User
lt: Pridėti vartotoją

source: Edit User
lt: Redaguoti vartotoją

source: New User
lt: Naujas vartotojas

source: Users
lt: Vartotojai

source: Please enter your username and password
lt: Įveskite savo vartotojo vardą ir slaptažodį

source: Login
lt: Prisijungti

source: Delete User
lt: Ištrinti vartotoją

source: Email
lt: El. paštas

source: Password
lt: Slaptažodis

source: Modified
lt: Atnaujinta

source: Related Wallets
lt: Susijusios piniginės

source: User Id
lt: Vartotojo ID

source: Balance
lt: Balansas

source: Currency
lt: Valiuta

source: Add Wallet
lt: Pridėti piniginę

source: Edit Wallet
lt: Redaguoti piniginę

source: Wallets
lt: Piniginės

source: Delete Wallet
lt: Ištrinti piniginę

source: User
lt: Vartotojas

source: Related Transactions
lt: Susijusios transakcijos

source: home.title
lt: Rontgen Tech Užduotis

source: home.welcome
lt: Sveiki atvykę į Rontgen Tech Kandidato Užduotį!

source: home.intro
lt: Šios užduoties tikslas – įvertinti jūsų techninius gebėjimus, problemų sprendimo eigą ir bendravimo įgūdžius dirbant su realistišku scenarijumi.

source: home.tasks.title
lt: Užduotys

source: home.tasks.task1.title
lt: Kodo dokumentavimas

source: home.tasks.task1.description
lt: Išanalizuokite esamą kodo bazę ir dokumentuokite pagrindinę projekto logiką, struktūrą ir duomenų srautus.

source: home.tasks.task2.title
lt: Problemos sprendimas (Bug Fix)

source: home.tasks.task2.description
lt: Repozitorijoje rasite sukurtą *issue*, kuris imituoja kliento pranešimą apie klaidą. Yra trys klaidos - išanalizuokite problemas ir ištaisykite bent vieną ar visas tris klaidas.

source: home.tasks.task3.title
lt: Naujos funkcijos kūrimas (Feature Request)

source: home.tasks.task3.description
lt: Sukurkite paskolų valdymo sistemą: egzistuoja admin valdymo skyde paskolų sukurimas ir forma, kur naudotojai gali prašyti paskolos. Integruokite metodiką paskolos gavėjo tinkamumo patikrinimui. Patvirtinti paskolų gavėjai atsiranda sąraše su nurodytomis procentinėmis palūkanomis, kurios gaunamos nuo investuotos sumos ir pervedamos į investuotojo piniginės adresą. Investuoti pinigiai pervedami į paskolos gavėjo/projekto piniginės adresą.

source: home.tasks.task4.title
lt: Bonusinė užduotis (Investment Criteria)

source: home.tasks.task4.description
lt: Sukurkite galimybę investuotojui nurodyti kriterijus pagal kuriuos galėtų investuoti. Siūlomi kriterijai: kredito įvertinimas ir nemokumo tikimybė, paskolos suma ir terminas, palūkanų normos lūkesčiai, rizikos tolerancijos lygis, skolininko pajamų patvirtinimas, paskolos paskirtis ir užstatas, geografinės preferencijos, diversifikacija tarp kelių paskolų. Pagalvokite ir pasiūlykite papildomus kriterijus.

source: home.login_button
lt: Prisijungti

source: login.title
lt: Prisijungimas

source: login.email
lt: El. paštas

source: login.password
lt: Slaptažodis

source: login.button
lt: Prisijungti

source: login.register_link
lt: Neturite paskyros? Registruokitės

source: login.test_credentials.title
lt: Testiniai prisijungimo duomenys

source: login.test_credentials.email
lt: El. paštas

source: login.test_credentials.password
lt: Slaptažodis

source: register.title
lt: Registracija

source: register.email
lt: El. paštas

source: register.password
lt: Slaptažodis

source: layout.documentation
lt: Dokumentacija

source: layout.api
lt: API

source: layout.login
lt: Prisijungti

source: layout.register
lt: Registruotis

source: layout.logout
lt: Atsijungti

source: register.button
lt: Registruotis

source: topup.page_title
lt: Papildyti piniginę - Mano Piniginė

source: topup.logo
lt: 💰 Mano Piniginė

source: topup.back_button
lt: ← Grįžti į valdymo skydą

source: topup.redirect.title
lt: 💳 Nukreipiama į mokėjimą

source: topup.redirect.message
lt: Būsite nukreipti į Paysera, kad užbaigtumėte €{amount} mokėjimą.

source: topup.redirect.button
lt: Tęsti su Paysera →

source: topup.redirect.secure_title
lt: 🔒 Saugus mokėjimas

source: topup.redirect.secure_description
lt: Jūsų mokėjimas apdorojamas saugiai per Paysera. Po užbaigimo būsite nukreipti atgal į savo piniginę.

source: topup.form.title
lt: 💳 Papildyti piniginę

source: topup.form.subtitle
lt: Pridėkite pinigų į savo piniginę naudodami Paysera

source: topup.form.current_balance
lt: Dabartinis balansas

source: topup.form.quick_amount_label
lt: Greitas sumos pasirinkimas

source: topup.form.custom_amount_label
lt: Arba įveskite pasirinktą sumą (EUR)

source: topup.form.amount_help
lt: Minimumas: €1.00 | Maksimumas: €1000.00

source: topup.form.payment_info_title
lt: 🔒 Apie Paysera mokėjimą

source: topup.form.payment_info_details
lt: • Saugus mokėjimų apdorojimas per Paysera<br>• Palaiko pagrindines kredito/debeto korteles<br>• Momentinis piniginės papildymas po sėkmingo mokėjimo<br>• Testavimo aplinka - tikri pinigai nebus nuskaičiuoti

source: topup.form.proceed_button
lt: Tęsti mokėjimą

source: topup.form.cancel_button
lt: Atšaukti

source: topup.form.pay_button
lt: Mokėti €{amount} su Paysera

source: Request Loan
lt: Paskolos prašymas

source: Project Name
lt: Projekto pavadinimas

source: Monthly Income
lt: Mėnesio pajamos (EUR)

source: Credit Score
lt: Kredito reitingas

source: Interest Rate
lt: Palūkanų norma

source: Return Date
lt: Paskolos grąžinimo data

source: Submit Request
lt: Pateikti prašymą

source: Borrowing Amount
lt: Skolinimosi suma

source: Status
lt: Būsena

source: Interest %
lt: Palūkanos %

source: requested
lt: prašoma

source: Repay Investors Now
lt: Grąžinti dabar

source: finished
lt: baigta

source: Already Repaid
lt: Jau grąžinta

source: My Loans
lt: Mano paskolos

source: Project
lt: Projekto pavadinimas

source: Investment Opportunities & Status
lt: Investicijų galimybės ir būklė

source: Borrower
lt: Skolininkas

source: Total Amount
lt: Bendra suma

source: Amount Left
lt: Likusi suma

source: Interest Rate (%)
lt: Palūkanų norma (%)

source: Repayment Status
lt: Grąžinimo būklė

source: Actions
lt: Veiksmai

source: Requested
lt: Laukiama

source: Invested At
lt: Investuota

source: Pending
lt: Laukiama

source: Rejected
lt: Atmesta

source: Finished
lt: Baigta

source: Paid Back
lt: Grąžinta

source: My Investments
lt: Mano investicijos

source: Loan
lt: Paskola

source: Action
lt: Veiksmas

source: funded
lt: finansuota

source: View
lt: Peržiūrėti

source: Invest
lt: Investuoti

source: Open
lt: Atidaryta

source: Edit Loan
lt: Redaguoti paskolą

source: Investment Details
lt: Investicijų detalės

source: Investor
lt: Investuotojo ID

source: Amount Invested
lt: Investuota suma

source: Loan Information
lt: Paskolos informacija

source: Total Loan Amount
lt: Bendra paskolos suma

source: Loan Status
lt: Paskolos būsena

source: Funded
lt: Finansuota

source: approved
lt: patvirtinta

source: Approved
lt: Patvirtinta

source: Approve
lt: Patvirtinti

source: Invest in Loan: {0}
lt: Investuoti į paskolą: {0}

source: Total Amount:
lt: Bendra suma:

source: Amount Left to Invest:
lt: Likusi suma investuoti:

source: Interest Rate:
lt: Palūkanų norma:

source: Invest Amount
lt: Investuoti sumą

source: Invest Now
lt: Investuoti dabar

source: All Investments
lt: Visos investicijos

source: Loan Project
lt: Paskolos projektas

source: Invested On
lt: Investuota

source: Edit Investment
lt: Redaguoti investiciją

source: Please update the investment details
lt: Prašome atnaujinti investicijos detales

source: Update Investment
lt: Atnaujinti investiciją

source: Collateral Available?
lt: Ar yra užstatas?

source: No
lt: Ne

source: Country
lt: Šalis

source: Purpose
lt: Paskirtis

source: Business or Individual?
lt: Verslas ar fizinis asmuo?

source: Do You Own Real Estate?
lt: Ar turite nekilnojamojo turto?

source: Set Your Investment Criteria
lt: Nustatykite savo investavimo kriterijus

source: Minimum Credit Score
lt: Minimalus kredito balas

source: Min Loan Amount
lt: Mažiausia paskolos suma

source: Max Loan Amount
lt: Didžiausia paskolos suma

source: Any
lt: Bet kuris

source: Very Low
lt: Labai žema

source: Low
lt: Žema

source: Medium
lt: Vidutinė

source: High
lt: Aukšta

source: Very High
lt: Labai aukšta

source: Maximum Risk Tolerance
lt: Didžiausia rizikos tolerancija

source: Loan Purpose
lt: Paskolos paskirtis

source: Real Estate
lt: Nekilnojamasis turtas

source: Business
lt: Verslas

source: Equipment Purchase
lt: Įrangos pirkimas

source: Expading Services
lt: Paslaugų plėtra

source: Marketing
lt: Marketingas

source: Franchise
lt: Franšizė

source: Require Collateral
lt: Reikalauti užstato

source: Require Real Estate
lt: Reikalauti nekilnojamojo turto

source: Business or Individual
lt: Verslas ar fizinis asmuo

source: Yes
lt: Taip

source: Individual
lt: Fizinis asmuo

source: Lithuania
lt: Lietuva

source: Latvia
lt: Latvija

source: Estonia
lt: Estija

source: Poland
lt: Lenkija

source: Germany
lt: Vokietija

source: France
lt: Prancūzija

source: Spain
lt: Ispanija

source: Italy
lt: Italija

source: United Kingdom
lt: Jungtinė Karalystė

source: United States
lt: Jungtinės Valstijos

source: Preferred Country
lt: Pageidaujama šalis

source: Save Criteria
lt: Išsaugoti kriterijus

source: Reset All Criteria
lt: Atstatyti visus kriterijus

source: Are you sure you want to reset all your investment criteria?
lt: Ar tikrai norite atstatyti visus savo investavimo kriterijus?

source: Loan Details
lt: Paskolos informacija

source: Loan ID
lt: Paskolos ID

source: Business/Individual
lt: Verslas / Fizinio asmens statusas

source: Income
lt: Pajamos

source: Collateral Required?
lt: Reikalingas užstatas?

source: Real Estate Required?
lt: Reikalingas nekilnojamasis turtas?

source: Risk Level
lt: Rizikos lygis

source: Loan Repayment Date
lt: Paskolos grąžinimo data

source: Investments
lt: Investicijos

source: No investments yet for this loan.
lt: Dar nėra investicijų į šią paskolą.
